---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAggregateIterator.Dispose
source: html/476a8bc1-7213-e0c2-f14d-6d558e18e94c.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregateIterator.Dispose Method

Releases all resources used by the IFCAggregateIterator

## Syntax (C#)
```csharp
public void Dispose()
```